Revit 2026 API

# MasonryCMUMasonryCMUApplication Property

---

The property labeled "Finish" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUApplication { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUApplication As String
	Get
```
```cpp
public:
static property String^ MasonryCMUApplication {
	String^ get ();
}
```
```fsharp
static member MasonryCMUApplication : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUApplicationType".

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace